# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge of `JOIN` statements, using various types of joins and various methods for specifying the links between them.

## Objectives

You will be able to:
* Write SQL queries that make use of various types of joins
* Compare and contrast the various types of joins
* Discuss how primary and foreign keys are used in SQL
* Decide and perform whichever type of join is best for retrieving desired data

## CRM Schema

In almost all cases, rather than just working with a single table you will typically need data from multiple tables. 
Doing this requires the use of **joins** using shared columns from the two tables. 

In this lab, you'll use the same customer relationship management (CRM) database that you saw from the previous lesson.
<img src='images/Database-Schema.png' width="600">

## Connecting to the Database
Import the necessary packages and connect to the database `'data.sqlite'`.

In [1]:
import pandas as pd
import sqlite3
conn = sqlite3.connect('data.sqlite')
cur = conn.cursor()

## Display the names of all the employees in Boston 

Hint: join the employees and offices tables.

In [2]:
cur.execute("""SELECT lastName, firstName 
               FROM employees
               JOIN offices
               USING(officeCode)
               WHERE city = 'Boston';""")
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df.head()

    lastName firstName
0   Firrelli     Julie
1  Patterson     Steve

## Are there any offices that have zero employees?
Hint: Combine the employees and offices tables and use a group by.

In [3]:
cur.execute("""SELECT o.officeCode, o.city, COUNT(e.employeeNumber) AS n_employees
               FROM offices o
               LEFT JOIN employees e
               USING(officeCode)
               GROUP BY officeCode
               HAVING n_employees = 0;""")
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df.head()

   officeCode    city  n_employees
0          27  Boston            0

## Write 3 Questions of your own and answer them

In [4]:
# Answers will vary
# Example: Display the htmlDescription and employee's first and last name for each product that each employee has sold

In [15]:
# Display the htmlDescription and employee's first and last name for each product that each employee has sold
cur.execute("""SELECT firstName, lastName, htmlDescription
               FROM employees e
               JOIN customers c
               ON e.employeeNumber = c.salesRepEmployeeNumber
               JOIN orders
               USING(customerNumber)
               JOIN orderdetails
               USING(orderNumber)
               JOIN products 
               USING(productCode)
               JOIN productlines
               USING(productLine)
               ORDER BY firstName;""")
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df.head()

  firstName lastName htmlDescription
0      Andy   Fixter
1      Andy   Fixter
2      Andy   Fixter
3      Andy   Fixter
4      Andy   Fixter

In [ ]:
# Your code here

In [ ]:
# Your code here

## Level Up: Display the names of every individual product that each employee has sold

In [5]:
cur.execute("""SELECT lastName, firstName, productName
               FROM employees e
               JOIN customers c
               ON e.employeeNumber = c.salesRepEmployeeNumber
               JOIN orders
               USING(customerNumber)
               JOIN orderdetails
               USING(orderNumber)
               JOIN products 
               USING(productCode);""")
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df.head()

   lastName firstName                                  productName
0  Jennings    Leslie                               1958 Setra Bus
1  Jennings    Leslie                       1940 Ford Pickup Truck
2  Jennings    Leslie                      1939 Cadillac Limousine
3  Jennings    Leslie  1996 Peterbilt 379 Stake Bed with Outrigger
4  Jennings    Leslie                            1968 Ford Mustang

## Level Up: Display the Number of Products each employee has sold

In [10]:
cur.execute("""SELECT firstName, lastName, COUNT(productName) as num_prod_sold
               FROM employees e
               JOIN customers c
               ON e.employeeNumber = c.salesRepEmployeeNumber
               JOIN orders
               USING(customerNumber)
               JOIN orderdetails
               USING(orderNumber)
               JOIN products 
               USING(productCode)
               GROUP BY employeeNumber
               ORDER BY firstName;""")
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
display(df)

   firstName   lastName  num_prod_sold
0       Andy     Fixter            185
1      Barry      Jones            220
2   Foon Yue      Tseng            142
3     George     Vanauf            211
4     Gerard  Hernandez            396
5      Julie   Firrelli            124
6      Larry       Bott            236
7     Leslie   Jennings            331
8     Leslie   Thompson            114
9       Loui     Bondur            177
10      Mami      Nishi            137
11    Martin     Gerard            114
12    Pamela   Castillo            272
13     Peter      Marsh            185
14     Steve  Patterson            152

## Summary

Congrats! You practiced using join statements and leveraged your foreign keys knowledge!